<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="args:0" type="Parameter" version="opset1">
			<data shape="2,48,14,10" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="args:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_635529" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_635530" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>10</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Transpose_635532_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 10, 3, 3" offset="32" size="11520" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Transpose_635532" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Convolution_635533" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>10</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>10</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_635829" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_635553_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="11552" size="73728" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_635553" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Convolution_635554" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Transpose_635837" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Transpose_635562_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="85280" size="73728" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Transpose_635562" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Convolution_635563" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Transpose_635847" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_635846" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="159008" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="custom_neural_receiver_11_1/residual_block_10_1/add" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="custom_neural_receiver_11_1/residual_block_10_1/add:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Transpose_637698_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="159040" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Transpose_637698" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="custom_neural_receiver_11_1/dense_27_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="custom_neural_receiver_11_1/dense_27_1/BiasAdd:0,custom_neural_receiver_11_1/dense_27_1/MatMul:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="custom_neural_receiver_11_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="custom_neural_receiver_11_1/Relu:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Transpose_637701_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="167232" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_637701" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="custom_neural_receiver_11_1/dense_28_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="custom_neural_receiver_11_1/dense_28_1/BiasAdd:0,custom_neural_receiver_11_1/dense_28_1/MatMul:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="custom_neural_receiver_11_1/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="custom_neural_receiver_11_1/Relu_1:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Transpose_637704_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 64" offset="175424" size="4096" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Transpose_637704" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="custom_neural_receiver_11_1/dense_29_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="custom_neural_receiver_11_1/dense_29_1/MatMul:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_635962" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Transpose_635963" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="custom_neural_receiver_11_1/dense_29_1/BiasAdd:0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Transpose_635578" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="custom_neural_receiver_11_1/Relu_2:0">
					<dim>2</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Transpose_635580_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 32, 3, 3" offset="179520" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Transpose_635580" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Convolution_635581" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_635852" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="159008" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="custom_neural_receiver_11_1/conv2d_40_1/BiasAdd" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Identity:0,custom_neural_receiver_11_1/conv2d_40_1/BiasAdd:0">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Identity:0" type="Result" version="opset1" output_names="Identity:0,custom_neural_receiver_11_1/conv2d_40_1/BiasAdd:0">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>48</dim>
					<dim>14</dim>
					<dim>2</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="5" from-port="2" to-layer="14" to-port="1" />
		<edge from-layer="6" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="25" from-port="0" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="29" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="1" />
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="33" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="0" />
		<edge from-layer="32" from-port="1" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="36" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2025.1.0-18503-6fec06580ab-releases/2025/1" />
		<conversion_parameters>
			<framework value="tf" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
